{
    "version": "0.0.14",
    "alerts": {
        "0.0.14": {
            "title": "Обновление 0.0.14",
            "description": "Добавлено: Фильтрация по ключевым словам. С помощью нового функционала вы можете сделать фильтрацию на уровне клиента на загруженных вами логах. Удобно если у вас открыто 1000 строчек и необходимо найти нужные значения"
        },
        "0.0.13": {
            "title": "Обновление 0.0.13",
            "description": "Добавлено: Отображение названия идентификаторов (нашивки предметов): защита, реген, урон, удача, плюс хп<br>Добавлено: У ссылок на форуме по умолчанию терерь показаны 1000 строчек в логах<br>Добавлено: Дата у предметов 03:00 01.01.1970 заменена на символ -"
        },
        "0.0.12": {
            "title": "Обновление 0.0.12",
            "description": "Обновление для форума. В тех. разделе ссылка со старых логов заменяется на новые в жалобе от игрока"
        },
        "0.0.11": {
            "title": "Обновление 0.0.11",
            "description": "Добавлено: Скрытие колонки с балансом игрока. По умолчанию выключено<br>Добавлено: Отображение рег. ип на уровне со строкой авторизации. По умолчанию выключено<br>Исправлено: В темной теме иконка даты в поле \"Указать конкретный день\" не отображалась<br>Исправлено: Кнопки в меню с настройками не сохранялись<br>Исправлено: Меню с настройкой не закрывалось"
        },
        "0.0.10": {
            "title": "Обновление 0.0.10",
            "description": "Внутренние исправления"
        },
        "0.0.9": {
            "title": "Обновление 0.0.9",
            "description": "Добавлены подсказки по цветам<br>Исправлена проблема с обновлением со слабым интернет-соединением"
        },
        "0.0.8": {
            "title": "Обновление 0.0.8",
            "description": "Добавлена информация по входам на аккаунт через бота"    
        },
        "0.0.7": {
            "title": "Обновление 0.0.7",
            "description": "Добавлено меню с настройкой скрипта"    
        },
        "0.0.6": {
            "title": "Обновление 0.0.6",
            "description": "Внутренние проработки"    
        },
        "0.0.5": {
            "title": "Обновление 0.0.5",
            "description": "Защита от фармеров: Дублирующие логи теперь скрываются"    
        },
        "0.0.4": {
            "title": "Обновление 0.0.4",
            "description": "Убрана левая панель\nКалендарь с конкретной датой перенесен в форму"    
        },
        "0.0.3": {
            "title": "Обновление 0.0.3",
            "description": "Добавлено отображение рег. ип игрока. Появляется если вы указали ID или имя в поиске\nДобавлено автообновление скрипта"
        }
    }
}
