{
    "version": "1.0.24",
    "alerts": {
        "1.0.24": {
            "title": "Обновление 24",
            "description": "Была проведена большая работа над скриптом: полностью переписан весь функционал. Теперь скрипт все подгружает в 3 раза быстрее. <br>Переработан раздел настроек, позволяющий гибко подстраивать под себя работу<br>Для слабых компьютеров добавлена возможность отключение нагружаемого функционала<br>Скрипт старается больше не нагружать процессор так сильно, как было раньше<br>Добавлены дополнительные настройки для левой панели<br>Временно с форума убрано изменение ссылки в тех разделе с добавлением лимита в 1000 строчек"
        },
        "0.0.23": {
            "title": "Обновление 23",
            "description": "Изменено: временно убрана возможность просматривать более 1000 строчек с логов"
        },
        "0.0.22": {
            "title": "Обновление 22",
            "description": "Добавлено: настройка цвета последнего IP игрока"
        },
        "0.0.21": {
            "title": "Обновление 21",
            "description": "Исправлены ошибки того, кто занимается форумом - поправлена ссылка на логи в тех разделе: при переходе по ссылке отсутствует редирект, логи открываются с ником, добавлен лимит в 1000 записей"
        },
        "0.0.20": {
            "title": "Обновление 20",
            "description": "Исправлено: Ошибка с отображением IP-адреса"
        },
        "0.0.19": {
            "title": "Обновление 19",
            "description": "Реализована возможность загружать более 1000 строчек в логах на странице"
        },
        "0.0.18": {
            "title": "Обновление 18",
            "description": "Добавлено: Создание форм. С помощью кнопки \"Форма\" вы можете сгенерировать команды на бан, деморган и прочее прямо на странице логов<br>Из строчек, которые указаны ниже, будет создана форма. Под форму попадают все пользователи, строчки в логах которые начинаются на Игрок Name<br><br>Например, данный шаблон создаст команды на бан:<br>/banoff 0 {user} 2000 махинации<br>Скрипт будет собирать только те строчки, которые отображены у вас. Если вы воспользовались фильтром на скрытие каких-то строчек, то их не будет в форме."
        },
        "0.0.17": {
            "title": "Обновление 17",
            "description": "Переписана обработка логов и получение информации по IP-адресам<br>Добавлено: Примерное расстояние между регистрационным и последним IP-адресом отображается на строчке с авторизацией. Отображается в логах игрока<br>Добавлено: Настройка видимости колонки с IP-адресами<br>Добавлено: Конвертирование евро в доллары. Курс настраивается в настройках скрипта. Если необходимо отключить - укажите 0"
        },
        "0.0.16": {
            "title": "Обновление 16",
            "description": "Исправлено: Некорректно отображалось количество переданных и полученных вещей<br>Исправлено: Отображался стандартный курсор на кликабельном ID предмета"
        },
        "0.0.15": {
            "title": "Обновление 15",
            "description": "Добавлено: Нажимая на ID предмета левой кнопкой мыши откроется изображение этого предмета<br>Добавлено: В фильтр логов добавлен обратный режим скрывать логи по указанным фильтрам<br>Добавлено: Выбор цвета для дублирующих строк. Указывать можно в HEX-формате, например #FF0000<br>Исправлено: В темной теме не отображалась иконка сбросить фильтр"
        },
        "0.0.14": {
            "title": "Обновление 14",
            "description": "Добавлено: Фильтрация по ключевым словам. С помощью нового функционала вы можете сделать фильтрацию на уровне клиента на загруженных вами логах. Удобно если у вас открыто 1000 строчек и необходимо найти нужные значения"
        },
        "0.0.13": {
            "title": "Обновление 13",
            "description": "Добавлено: Отображение названия идентификаторов (нашивки предметов): защита, реген, урон, удача, плюс хп<br>Добавлено: У ссылок на форуме по умолчанию терерь показаны 1000 строчек в логах<br>Добавлено: Дата у предметов 03:00 01.01.1970 заменена на символ -"
        },
        "0.0.12": {
            "title": "Обновление 12",
            "description": "Обновление для форума. В тех. разделе ссылка со старых логов заменяется на новые в жалобе от игрока"
        },
        "0.0.11": {
            "title": "Обновление 11",
            "description": "Добавлено: Скрытие колонки с балансом игрока. По умолчанию выключено<br>Добавлено: Отображение рег. ип на уровне со строкой авторизации. По умолчанию выключено<br>Исправлено: В темной теме иконка даты в поле \"Указать конкретный день\" не отображалась<br>Исправлено: Кнопки в меню с настройками не сохранялись<br>Исправлено: Меню с настройкой не закрывалось"
        },
        "0.0.10": {
            "title": "Обновление 10",
            "description": "Внутренние исправления"
        },
        "0.0.9": {
            "title": "Обновление 9",
            "description": "Добавлены подсказки по цветам<br>Исправлена проблема с обновлением со слабым интернет-соединением"
        },
        "0.0.8": {
            "title": "Обновление 8",
            "description": "Добавлена информация по входам на аккаунт через бота"    
        },
        "0.0.7": {
            "title": "Обновление 7",
            "description": "Добавлено меню с настройкой скрипта"    
        },
        "0.0.6": {
            "title": "Обновление 6",
            "description": "Внутренние проработки"    
        },
        "0.0.5": {
            "title": "Обновление 5",
            "description": "Защита от фармеров: Дублирующие логи теперь скрываются"    
        },
        "0.0.4": {
            "title": "Обновление 4",
            "description": "Убрана левая панель\nКалендарь с конкретной датой перенесен в форму"    
        },
        "0.0.3": {
            "title": "Обновление 3",
            "description": "Добавлено отображение рег. ип игрока. Появляется если вы указали ID или имя в поиске\nДобавлено автообновление скрипта"
        }
    }
}
